<?php

/*1. С помощью цикла while вывести все числа в промежутке от 0 до 100, которые делятся на 3 без остатка.

$a = 0;

while ($a <= 100) {
    if ($a % 3 == 0){
    echo $a . "<br>";
    }
    $a++;
}*/

/*2. С помощью цикла do…while написать функцию для вывода чисел от 0 до 10, чтобы результат выглядел так:
0 – ноль.
1 – нечетное число.
2 – четное число.
3 – нечетное число.
…
10 – четное число.*/

$b = 0;

do {
    echo $b . naming ($b) . "<br>";
    $b++;
}
while ($b <= 10);

function naming ($b) {
    if ($b == 0) {
        return " - ноль";
    }
    elseif ($b % 2 == 0) {
        return " - четное число";
    }
    else {
        return " - нечетное число";
    }
}

/*3. Объявить массив, в котором в качестве ключей будут использоваться названия областей, 
а в качестве значений – массивы с названиями городов из соответствующей области. 
Вывести в цикле значения массива, чтобы результат был таким:
Московская область:
Москва, Зеленоград, Клин
Ленинградская область:
Санкт-Петербург, Всеволожск, Павловск, Кронштадт
Рязанская область … (названия городов можно найти на maps.yandex.ru)*/

$areas = [
    'Московская область' => ['Москва', 'Зеленоград', 'Клин'],
    'Ленинградская область' => ['Санкт-Петербург', 'Всеволожск', 'Павловск', 'Кронштадт'],
    'Рязанская область' => ['Рязань', 'Касимов', 'Ряжск'],
];

foreach ($areas as $area => $value) {
    echo $area . ":" . "<br>";
    
    foreach ($value as $key => $city) {
        echo $city . ", ";
    }
    echo "<br>";
}

/*4. Объявить массив, индексами которого являются буквы русского языка, а значениями – 
соответствующие латинские буквосочетания ("а"=> "a", "б" => "b", "в" => "v", "г" => "g", …, 
"э" => "e", "ю" => "yu", "я" => "ya").
Написать функцию транслитерации строк.

function transliteration ($str) {
$letters = [
    "а"=> "a", "б" => "b", "в" => "v", "г" => "g", "д" => "d","е" => "e", "ж" => "zh", "з" => "z", 
    "и" => "i", "й" => "ii", "к" => "k", "л" => "l", "м" => "m", "н" => "n", "о" => "o", "п" => "p",
    "р" => "r", "с" => "s", "т" => "t", "у" => "u", "ф" => "f", "х" => "h", "ц" => "tz", "ч" => "ch", 
    "ш" => "sh", "щ" => "sch", "ы" => "y","э" => "e", "ю" => "yu", "я" => "ya"
];

$strArray = [];
$newArray = [];
    
    for ($i = 0; $i < strlen($str); $i++) {      
    
        $letter = mb_substr($str, $i, 1,'utf-8');
        array_push ($strArray, $letter);
    }    

    foreach ($strArray as $newKey => $newValue) {
        foreach ($letters as $key => $value){
            if ($newValue === $key) {            
                array_push ($newArray, $value);
            }    
        }
    }

//var_dump ($strArray);
var_dump ($newArray);
print_r ($newArray);
}

transliteration ('хорошая собака');*/
/*5. Написать функцию, которая заменяет в строке пробелы на подчеркивания и 
возвращает видоизмененную строчку.*/

function spaceToLine($str) {

    $strArray = [];
    
    for ($i = 0; $i < strlen($str); $i++) {      
    
        $letter = mb_substr($str, $i, 1,'utf-8');
        if ($letter == " ") {
            array_push ($strArray, "_");
         } elseif ($letter != "") {           
         array_push ($strArray, $letter);
         }
    }    

print_r ($strArray);

}

spaceToLine ('отличный кот');



?>
