<?php


/*6. * В имеющемся шаблоне сайта заменить статичное меню (ul – li) на генерируемое через PHP. 
Необходимо представить пункты меню как элементы массива и вывести их циклом. 
Подумать, как можно реализовать меню с вложенными подменю? Попробовать его реализовать.
<ul>
<li><a href="#">Главная</a></li>
<li><a href="#">Услуги</a></li>
<li><a href="#">Цены</a></li>
<li><a href="#">Контакты</a></li>
</ul>
*/

$menu = [
    'Главная' => '', 
    'Услуги' => ['1', '2', '3'], 
    'Цены' => '', 
    'Контакты' => ''
];
$linkBeg = '<li><a href="#">';
$linkEnd = '</a></li>';
echo "<ul>";
foreach ($menu as $key => $values) {
    echo $linkBeg . $key . $linkEnd; 

    if (is_array ($values)) {
        echo "<ul>";
        foreach ($values as $value) {
    
        echo $linkBeg . $value . $linkEnd;
        }
        echo "</ul>";
    }    
}
echo "</ul>";


/*7. *Вывести с помощью цикла for числа от 0 до 9, не используя тело цикла.*/

for ($n = 0; $n < 10; print $n++) {}
echo "<br>";

/*8. *Повторить третье задание, но вывести на экран только города, начинающиеся с буквы «К».*/

$areas = [
    'Московская область' => ['Москва', 'Зеленоград', 'Клин'],
    'Ленинградская область' => ['Санкт-Петербург', 'Всеволожск', 'Павловск', 'Кронштадт'],
    'Рязанская область' => ['Рязань', 'Касимов', 'Ряжск'],
];

$letter = "К";
foreach ($areas as $area => $value) {
        
    foreach ($value as $key => $city) {
        $firstLetter = mb_substr ($city, 0, 1);
        
        if ($firstLetter == $letter) {
        echo $city;
        }
    }
    echo "<br>";
}

/*9. *Объединить две ранее написанные функции в одну, которая получает строку на русском языке, 
производит транслитерацию и замену пробелов на подчеркивания (аналогичная задача решается при 
конструировании url-адресов на основе названия статьи в блогах).*/

function transliteration ($str) {
    $letters = [
        "а"=> "a", "б" => "b", "в" => "v", "г" => "g", "д" => "d","е" => "e", "ж" => "zh", "з" => "z", 
        "и" => "i", "й" => "ii", "к" => "k", "л" => "l", "м" => "m", "н" => "n", "о" => "o", "п" => "p",
        "р" => "r", "с" => "s", "т" => "t", "у" => "u", "ф" => "f", "х" => "h", "ц" => "tz", "ч" => "ch", 
        "ш" => "sh", "щ" => "sch", "ы" => "y","э" => "e", "ю" => "yu", "я" => "ya", " " => "_"
    ];
    
    $strArray = [];
    $newArray = [];
        
    for ($i = 0; $i < strlen($str); $i++) {      
    
        $letter = mb_substr($str, $i, 1,'utf-8');
        array_push ($strArray, $letter);
    }    

    foreach ($strArray as $newKey => $newValue) {
        foreach ($letters as $key => $value){
            if ($newValue === $key) {            
                array_push ($newArray, $value);
            }    
        }
    }

    print_r ($newArray);
}  
 
    
    transliteration ('хорошая кошка');


?>
